Revit 2026 API

# WorksharingUtilsGetWorksharingTooltipInfo Method

---

Gets worksharing information about an element to display in an in-canvas tooltip.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static WorksharingTooltipInfo GetWorksharingTooltipInfo(
	Document document,
	ElementId elementId
)
```
```vb
Public Shared Function GetWorksharingTooltipInfo (
	document As Document,
	elementId As ElementId
) As WorksharingTooltipInfo
```
```cpp
public:
static WorksharingTooltipInfo^ GetWorksharingTooltipInfo(
	Document^ document,
	ElementId^ elementId
)
```
```fsharp
static member GetWorksharingTooltipInfo :
        document : Document *
        elementId : ElementId -> WorksharingTooltipInfo
```

#### Parameters

document Document
     The document containing the element
elementId ElementId
     The id of the element in question

#### Return Value

WorksharingTooltipInfo Worksharing information about the specified element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If there is no element corresponding to the given id, then all the strings returned in WorksharingTooltipInfo are empty.

The return value may not be dependable in the middle of a transaction. See the remarks on WorksharingUtils for more details.

#### Reference

WorksharingUtils Class

Autodesk.Revit.DB Namespace